[Killed] BlockStatement
src/operacoes.js:37:31
   if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
   return Math.max(...numeros);
 }
-function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
-  return Math.min(...numeros);soma
-}
+function minimoArray(numeros) {}
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] MethodExpression
src/operacoes.js:39:10
 }
 function minimoArray(numeros) {
   if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
-  return Math.min(...numeros);soma
+  return Math.max(...numeros);soma
 }
 function valorAbsoluto(n) { return Math.abs(n); }
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 12. deve encontrar o valor mínimo em um array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 100
